# Station Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelOptions..::..Station Property
AlignmentStationLabelOptions Class See Also
---
Specifies the station at which the label will be placed, in Revit internal model units (standard Imperial feet). The station determines the location of the label's origin: Origin by setting it to the closest point on the alignment geometry which corresponds to this station.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public double Station { get; set; }
```

Visual Basic
---
```text
Public Property Station As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Station {
	double get ();
	void set (double value);
}
```

# See Also
AlignmentStationLabelOptions Class
Autodesk.Revit.DB.Infrastructure Namespace